# SlabShapeEditor Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
SlabShapeEditor Class
Members See Also
---
An object used for Slab Shape Editing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public class SlabShapeEditor
```

Visual Basic
---
```text
Public Class SlabShapeEditor
```

Visual C++
---
```text
public ref class SlabShapeEditor
```

# Remarks
The SlabShapeEditor can be obtained from a slab object, such as a roof or floor.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SlabShapeEditor
# See Also
SlabShapeEditor Members
Autodesk.Revit.DB Namespace